## Plan for scan_queue
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.sfn_events will be created
  + resource "aws_cloudwatch_event_rule" "sfn_events" {
      + arn            = (known after apply)
      + description    = "Capture State Machine events from the Scan queue step function"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail = {
                  + stateMachineArn = [
                      + "arn:aws:states:ca-central-1:806545929748:stateMachine:assemblyline-file-scan-queue",
                    ]
                  + status          = [
                      + "FAILED",
                      + "TIMED_OUT",
                      + "ABORTED",
                    ]
                }
              + source = [
                  + "aws.states",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "state-machine-production-lock-cleanup"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_target.sfn_events will be created
  + resource "aws_cloudwatch_event_target" "sfn_events" {
      + arn            = "arn:aws:states:ca-central-1:806545929748:stateMachine:assemblyline-file-scan-queue-lock-cleanup"
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::806545929748:role/scan-files-scan_queue"
      + rule           = "state-machine-production-lock-cleanup"
      + target_id      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.sfn_events"]

9 tests, 8 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
